Repository: giellalt/corpus-sme
Catalog: prestable/tmx/smj/admin/depts/other_files/laereplan_engelsk.html.tmx
Source language: sme
Languages: smj

source: áddet ja geavahit muhtun eaŋgalsgiel sániid, dadjanvugiid ja cealkkaminstariid mat gusket lagašbirrasii ja iežas beroštumiide
smj: dádjadit ja adnet ieŋŋilsgielak bágojt, moallánahkkojt ja gárgadisájt lahka birrusijs ja ietjas berustimes

source: dearvvahit, jearrat ja vástidit álkes gažaldagaid ja geavahit muhtun buorremenolaš ovdanbuktimiid
smj: buorástahttet, gátjádit ja vásstedit álkkes gatjálvisájt ja adnet muhtem vættsásvuoda moallánahkkojt

source: searvat álkes, hárjehallon dialogaide ja spontána ságastallamiidda mat gusket lagašbirrasii ja iežas vásáhusaide
smj: oassálasstet álkkes guládallamijda ja ságastallamijda lahka birrusijs ja ietjas åtsådallamijs

source: geavahit loguid ságastaladettiin lagašbirrasa ja iežas vásáhusaid birra
smj: adnet tállajt gå le ságastallamin lahka birrusa ja ietjas åtsådallamij birra

source: dovdát muhtun eaŋgalsgiel giellajienaid ja stávvalminstariid oktavuođa
smj: dåbddåt aktijvuodav ieŋŋilsgielak giellajienaj ja stávimvuoge gaskan

source: geahččalit lohkat ja čállit eaŋgalsgiel sániid, dadjanvugiid ja álkes cealkagiid mat gusket lagašbirrasii ja iežas beroštumiide
smj: gæhttjaladdat låhkat ja tjállet ieŋŋilsgielak bágojt, moallánahkkojt ja álkkes gárgadisájt lahka birrusijs ja ietjas berustimes

source: ságastallat mánáid árgabeaidilis eaŋgalsgiel riikkain
smj: ságastallat mánáj bæjválasj iellema birra ieŋŋilsgielak rijkajn

source: oassálastit eaŋgalsgiel riikkaid mánáidkultuvrrain geavahettiin sániid, govaid, musihka ja lihkadeami
smj: oasev válldet ja åtsådallat mánájkultuvrav ieŋŋilsgielak rijkajs bágoj, gåvåj, musihka ja labudallama baktu

source: muitalit mo iežas mielas leat eaŋgalsgiel riimmat, hoahkamat, lávlagat, máidnasat ja muitalusat
smj: giehttot ietjas åtsådallamijt ieŋŋilsgielak rijmajs, gáritjijs, lávllagijs ja subttsasijs

source: Gelbbolašvuođamihttomearit 4. jahkeceahki maŋŋil
smj: Máhtudakmihto 4. jahkedáse maŋŋela Giellaåhpadus

source: identifiseret dilálašvuođaid main sáhttá leat ávkkálaš dahje dárbbalaš máhttit eaŋgalsgiela
smj: identifiserit dilijt gånne le ávkálasj jali dárbulasj ieŋŋilsgielav máhttet

source: ságastallat iežas eaŋgalsgieloahpahallama birra
smj: ságastallat gåktu iesj ieŋŋilsgielav oahppá

source: gávdnat seammaláganvuođaid eaŋgalsgiel ja iežas eatnigiela sániid ja dadjanvugiid gaskkas
smj: gávnnat bágojt ja moallánahkkojt ma li muodugattja ieŋŋilsgielan ja ietjas iednegielan

source: geavahit digitála resurssaid ja eará veahkkeneavvuid suokkardit giela
smj: adnet digitále ressursajt ja ietjá viehkkenævojt gå le gielav guoradallamin

source: geavahit álkes guldalan- ja hállanstrategiijaid
smj: adnet álkkes gulldalim- ja hållamstrategijajt

source: guldalit ja áddet sániid ja dadjanvugiid mearkkašumi das makkár oktavuođas dat geavahuvvojit
smj: gulldalit ja dádjadit bágoj ja moallánahkkoj sisanov aktijvuodas gånna aneduvvi

source: áddet ja geavahit eaŋgalsgiel sániid, dadjanvugiid ja cealkkaminstariid mat gusket iežas dárbbuide ja dovdduide, árgabeaivái, astoáigái ja beroštumiide
smj: dádjadit ja adnet ieŋŋilsgiela bágojt, moallánahkkojt ja gárgadisájt tjanádum ietjas dárbojda ja dåbdojda, bæjválasj iellemij, friddjaájggáj ja berustimijda

source: áddet riimmaid, hoahkamiid, lávlagiid, máidnasiid ja muitalusaid váldosisdoalu
smj: dádjadit oajvvesisanov rijmajn, gáritjijn, lávllagijn ja subttsasijn

source: geavahit muhtun buorremenolašvuođa ovdanbuktimiid ja álkes frásaid oažžun dihtii veahki áddet ja áddehallat
smj: adnet muhtem vættsásvuoda moallánahkkojt ja frásajt viehkken dádjadittjat ja dádjaduvátjit

source: searvat árgabeaiságastallamiidda mat gusket lagašbirrasii ja iežas vásáhusaide
smj: oasev válldet bæjválasj ságastallamijs lahkabirrusijs ja ietjas åtsådallamijs

source: lohkat eaŋgalsgiel alfabehta ja stávet namaid ja ássanbáikenamaid
smj: oahppat ieŋŋilsgiela alfabehtav ja stávut namájt ja årromsajij namájt

source: áddet ja geavahit sániid ja dadjanvugiid mat gusket hattiide, hivvodagaide, hámiide ja sturrodagaide go gulahallá árgabeaieallima, astoáiggi ja beroštumiid birra
smj: dádjadit ja adnet bágojt ja moallánahkkojt hattij birra, ednakvuoda, hámij ja stuorrudagáj birra gå le guládallamin bæjválasj iellema, friddjaájge ja berustimij birra Tjálalasj guládallam

source: geavahit álkes lohkan- ja čállinstrategiijaid
smj: adnet álkkes låkåm- ja tjállemstrategijajt

source: áddet eaŋgalsgiel giellajienaid ja bustávaid oktavuođaid ja máhttit bidjat jienaid sátnin
smj: dádjadit aktijvuodav ieŋŋilsgiela giellajienaj ja bokstávaj gaskan ja dahkat jienajs bágojt

source: áddet sániid ja dadjanvugiid mearkkašumi das makkár oktavuođas dat leat geavahuvvon
smj: dádjadit bágoj ja moallánahkko sisanov dat aktijvuodas gånnå aneduvvá

source: lohkat, áddet ja čállit eaŋgalsgiel sániid ja dadjanvugiid mat gusket iežas dárbbuide ja dovdduide, árgabeaieallimii, astoáigái ja beroštumiide
smj: låhkåt, dádjadit ja tjállet ieŋŋilsgiela bágojt ja moallánahkkojt ietjas dárbojda ja dåbdojda, bæjválasj iellemij, friddjaájgijda ja berustimijda

source: áddet váldosisdoalu álkes teavsttain oahpes fáttáid birra
smj: dádjadit oajvvesisanov álkkes tevstajs ja oahpes ássjijs

source: čállit oanehis teavsttaid mat muitalit oaiviliid ja beroštumiid, ja mat čilgejit, muitalit ja jearahit
smj: tjállet oanes tevstajt maj ájádusájt ja berustimijt gåvvi, ja ma tjielggiji, subtsasti ja mai gatjádallá

source: geavahit muhtun dábálaš smávvasániid ja álkes stáven- ja cealkkaminstariid
smj: adnet muhtem dábálasj smávep bágojt ja álkkes stávim- ja gárgadishámijt

source: geavahit digitála reaidduid háhkat dieđuid ja geahččaladdat hábmet teavstta
smj: adnet digitála vædtsagijt gå viedtjá diedojt ja gæhttjaladdat tevstajt dahkat

source: buktit muhtun ovdamearkkaid eaŋgalsgiel riikkaide ja dovddus olbmuide geat doppe leat eret
smj: vaddet muhtem buojkulvisájt ieŋŋilsgielak rijkajda ja dåbdos ulmutjijda dajs rijkajs

source: ságastallat beliid birra iešguđet eallinvugiin ja árbevieruin eaŋgalsgiel riikkain ja Norggas
smj: ságastallat viessomvuogij, dábij birra ieŋŋilsgielak rijkajn ja Vuona rijkan

source: searvat ovdanbuktit eaŋgalsgiel riimmaid, hoahkamiid, lávlagiid, oanehis teáhterbihtáid ja muitalusaid
smj: oasev válldet åvddånbuktemijs ieŋŋilsgielak rijmajs, gáritjijs, lávllagijs ja oanes oavdástallamijs ja subttsasijs

source: muitalit iežas jurdagiid ja oaiviliid deaivvadettiin eaŋgalsgiel girjjálašvuođain ja mánáidkultuvrrain
smj: giehttot ietjas ájádusáj ja vuojnoj birra gå le ieŋŋilsgielak girjálasjvuodajn ja mánájkultuvrajn barggamin

source: ráhkadit iežas teavsttaid main viežžá inspirašuvnna eaŋgalsgiel girjjálašvuođas ja mánáidkultuvrras
smj: tjállet ietjas tevstajt ma li bájnnum ieŋŋilsgielak girjálasjvuodas ja mánájkultuvras

source: identifiseret ja geavahit iešguđet dilálašvuođaid ja oahpahallanstrategiijaid nannet iežas eaŋgalsgielgálggaid
smj: identifiserit ja adnet duov dáv dilev ja oahppamstrategijav åvdedittjat ietjas ieŋŋelskgielak tjehpudagáv

source: válddahit iežas eaŋgalsgieloahpahallama
smj: gåvådit ja tjielggit ietjas bargov gå le ieŋŋilskgielav oahppamin

source: identifiseret muhtun gielalaš seammaláganvuođaid ja erohusaid eaŋgalsgielas ja iežas eatnigielas
smj: identifiserit mij le ja mij ij le gielalattjat muoduk ieŋŋelskgiela ja ietjas iednegiela gaskan

source: geavahit digitála resurssaid ja eará veahkkeneavvuid iežas giellaoahpahallamis
smj: adnet digitála ressursajt ja ietjá viehkkenævojt ietjas giellaåhpadusán

source: geavahit guldalan- ja hállanstrategiijaid
smj: adnet gulldalim- ja hållamstrategijajt

source: áddet ja geavahit oahpes fáttáide gullevaš sátneriggodaga
smj: dádjadit ja adnet báhkoboanndudagáv tjanádum oahpes ássjijda

source: áddet váldosisdoalu njálmmálaš teavsttain oahpes fáttáid birra
smj: dádjadit oajvvesisanov njálmálasj tevstajs ma li tjanádum oahpes ássjijda

source: geavahit buorremenolašvuođa ovdanbuktimiid ja dilálašvuhtii guoski dadjanvugiid
smj: adnet vættsásvuoda moallánahkkojt ja moallánahkkojt ma geŋga dilláj gullu

source: ovdanbuktit iežas oažžun dihtii veahki áddet ja áddehallat iešguđet dilálašvuođain
smj: moalgget vaj viehkev oadtju dádjadittjat ja dádjaduvátjit duon dán dilen

source: ovdanbuktit ja ákkastallat iežas oaivila oahpes fáttáin
smj: moalgget ja tjielggit ietjas vuojnojt oahpes ássjij gáktuj

source: álggahit, doalahit ja heaittihit ságastallamiid mat gusket oahpes dilálašvuođaide
smj: álgadit, ságastallat ja låhpadit ságastallamav tjanádum oahpes dilijda

source: geavahit jietnadeami, intonašuvnna, sátnesojaheami ja cealkkatiippaid vuođđominstariid gulahallamis
smj: adnet vuodo hámijt gå moalget, jiednat, bágojt såjåt ja gárgadisájt dahká guládaládijn

source: muitalit álkes rehkenastimiid, valuhta ja mihttoovttadagaid birra gulahaladettiin árgabeaidilis
smj: moalgget álkkes merustallamij birra, ja valuta ja mihttimavtadagáj birra gå le guládallamin bæjválasj dilen

source: geavahit lohkan- ja čállinstrategiijaid
smj: adnet låhkåm- ja tjállemstrategijajt

source: áddet ja geavahit sátneriggodaga mii gullá oahpes fáttáide
smj: dádjadit ja adnet báhkoboanndudagáv oahpes ássjij hárráj

source: áddet váldosisdoalu ieš válljen teavsttain
smj: dádjadit oajvvesisanov iesjválljidum tevstajn

source: lohkat ja áddet iešguđetlágan teavsttaid iešguđet hivvodagas iešguđet gálduin
smj: låhkåt ja dádjadit duov dáv tevstav duot dát stuorrudagás moattet gáldos

source: čállit notáhtaid hábmen dihtii iešguđetlágan teavsttaid
smj: tjállet notáhtajt majna ådå tevstajt dahká

source: čállit oktilaš teavsttaid mat muitalit, ođđasis muitalit, válddahit vásáhusaid ja muitalit iežas oaiviliid
smj: tjállet avtatraják tevstajt ma subtsasti, mujttali, gåvådi åtsådallamijt ja ietjas vuojnojt ja ájádusájt tjielggiji

source: geavahit riektačállima, sátnesojaheami, cealkka- ja teakstahuksema vuođđominstariid teakstabuvttadeamis
smj: adnet vuodulasj hámev duollatjállemis, báhkosåjådimes, gárgadis- ja tækstadahkamis gå le tevstajt tjállemin

source: geavahit digitála reaidduid ja eará veahkkeneavvuid gávdnat relevánta dieđuid ja hábmet iešguđetlágan teavsttaid
smj: adnet digitála vædtsagijt ja ietjá viehkkenævojt gå le guoskavasj diedojt åhtsåmin ja duov dáv tevstav dahkamin

source: muitalit olbmuid, báikkiid ja dáhpáhusaid birra eaŋgalsgiel riikkain
smj: subtsastit ulmutjij, bájkij ja dáhpádusáj birra ieŋŋilskgielak rijkajs

source: ságastallat eallinvugiid ja servvoštallanvugiid birra iešguđet kultuvrrain eaŋgalsgiel riikkain ja Norggas, earret eará sámi kultuvrra birra
smj: ságastallat viessomvuogij ja sæbrástallamvuogij birra duon dán kultuvran ieŋŋelskgielak rijkajn ja Vuona rijkan, ja aj sáme kultuvran

source: lohkat eaŋgalsgiel mánáid- ja nuoraidgirjjálašvuođa ja hállat olbmuid ja sisdoalu birra
smj: låhkåt ieŋŋelskgielak mánáj- ja nuorajgirjálasjvuodav ja ságastallat persåvnåj ja sisano birra

source: ovdanbuktit iežas reakšuvnnaid eaŋgalsgiel girjjálašvuođa teavsttaide, filmmaide, neahttakultuvrii, govaide ja musihkkii
smj: buktet ietjas dåbdojt ieŋŋgilskgielak girjálasj tevstaj hárráj, filmaj, næhttakultuvra, gåvåj ja musihka hárraj

source: ovdanbuktit iežas hutkás láhkai vieččadettiin inspirašuvnna iešguđetlágan gálduin vižžon eaŋgalsgiel girjjálašvuođas
smj: moalgget ja åvddånbuktet kreatijvalattjat arvusmahtedum moattelágásj ieŋŋelskgielak girjálasj tevstajt moattet gáldos

source: gaskkustit oanehis teavsttaid ieš válljen fáttáid birra
smj: gaskostit oanep tevstajt iesjválljidum ássjijs

source: Gelbbolašvuođamihttomearit 10. jahkeceahki maŋŋil
smj: Máhtudakmihto 10. jahkedáse maŋŋela Giellaåhpadus

source: geavahit iešguđet dilálašvuođaid, bargovugiid ja oahpahallanstrategiijaid ovdánahttit iežas eaŋgalsgielgálggaid
smj: adnet duov dáv dilev, barggovuogev ja oahppamstrategijav majna åvdedit ietjas tjehpudagáv ieŋŋelskgielan

source: kommenteret iežas eaŋgalsgieloahpahallama
smj: kommenterit ietjas bargov gå le ieŋŋelskgielav oahppamin

source: identifiseret guovddáš gielalaš seammaláganvuođaid ja erohusaid eaŋgalsgiela ja iežas eatnigiela gaskkas, ja geavahit dán iežas giellaoahpahallamis
smj: identifiserit dav mij le muoduk ja mij ij le muoduk ieŋŋelskgielan ja ietjas iednegielan, ja adnet dav gå le gielav oahppamin

source: válljet iešguđet digitála resurssaid ja eará veahkkeneavvuid, ja geavahit daid iešheanalaččat iežas giellaoahpahallamis
smj: válljit duov dáv digitála ressursav ja ietjá viehkkenævov, ja adnat dajt iesjrádálattjat gå gielav le oahppamin

source: válljet ja geavahit iešguđet guldalan- ja hállanstrategiijaid mat leat heivehuvvon ulbmilii
smj: válljit ja adnet duov dáv gulldalim- ja hållamstrategijav hiebaduvvam ulmmáj

source: áddet ja geavahit dábálaš sátneriggodaga mii guoská iešguđet fáttáide
smj: dádjadit ja adnet dábálasj báhkoboanndudagáv tjanádum duon dán ássjáj

source: čájehit dáidduid earuhit positiivvalaš ja negatiivvalaš dadjanvugiid mat refererejit ovttaskasolbmuide ja olmmošjoavkkuide
smj: máhttet sieradit positijvalasj ja negatijvalasj moalgedimij gaskav ma vuosedi ájnegisulmutjijda ja ja juohkusijda

source: áddet váldosisdoalu ja detáljjaid iešguđetlágan njálmmálaš teavsttain iešguđet fáttáid birra
smj: dádjadit oajvvesisanov ja detáljajt duot dát njálmálasj tevstas ma guosski duon dán ássjáj

source: guldalit ja áddet eaŋgalsgiela variánttaid iešguđet autenttalaš oktavuođain
smj: gulldalit ja dádjadit variántajt ieŋŋilskgielas moattet autentalasj diles

source: ovdanbuktit iežas njuovžilit ja oktilaččat mii lea heivehuvvon ulbmilii ja dilálašvuhtii
smj: adnet gielav duolla ja avtatbirges hiebadum ulmmáj ja dilláj

source: ovdanbuktit ja ákkastallat iežas oaivila iešguđet fáttáid birra
smj: moalgget ja tjielggit ietjas vuojnojt duon dán ássje hárráj

source: álggahit, doalahit ja loahpahit ságastallamiid iešguđet fáttáid birra gažadettiin ja čuovvolettiin árvalusaiguin
smj: álgadit, jådedit ja låhpadit ságastallamijt duon dán ássjen gatjádallama baktu ja gåtsedit tjuojggidusájt

source: geavahit jietnadeami, intonašuvnna, sátnesojaheami ja iešguđet cealkkatiippaid guovddáš minstariid gulahallamis
smj: adnet guovdásj gåvvusav jiednadime hárráj, intonasjåvnå, báhkosåjådime ja duon dán lágásj gárgadisáj hárráj guládallamin

source: áddet ja geavahit iešguđetlágan vugiid ovdanbuktit loguid ja eará dáhtaid gulahallamis
smj: dádjadit ja adnet moattelágásj tállamoallánagájt ja ietjá dáhtámoallánagájt guládallamin

source: válljet ja geavahit iešguđet lohkan- ja čállinstrategiijaid mat leat heivehuvvon ulbmilii
smj: válljit ja adnet duov dáv låhkåm- ja tjállemstrategijav mij le ulmmáj hiebadum

source: áddet ja geavahit dábálaš sátneriggodaga mii gullá iešguđet fáttáide
smj: dádjadit ja adnet dábálasj báhkoboanndudagáv duon dán ássje hárráj

source: áddet váldosisdoalu ja detáljjaid ieš válljen teavsttaid
smj: dádjadit oajvvesisanov ja detáljajt iesjválljidum tevstajn

source: lohkat, áddet ja árvvoštallat iešguđetlágan teavsttaid mat leat iešguđet guhkkodagas, ja máŋgga fáttás
smj: låhkåt, dádjadit ja árvustallat moattelágásj tevstav duot dát ássjes

source: geavahit iežas notáhtaid ja iešguđet gálduid čállima vuođđun
smj: adnet ietjas notáhtajt ja duov dáv gáldov vuodon tjállemij

source: čállit iešguđetlágan teavsttaid struktuvrrain ja oktilasat
smj: tjállet duov dáv tevstav mij le avtarájak ja struktuvrajn

source: geavahit riektačállima, sátnesojaheami, cealkka- ja teakstahuksema guovddáš minstariid teakstabuvttadeamis
smj: adnet guovdásj gåvvusav duollatjállema hárráj, báhkosåjådime, gárgadis- ja tækstadahkama hárráj gå le tevstajt buvtadime

source: diehtit persovdnasuodjaleami ja dahkkivuoigatvuođa birra ja válljet geavahit sisdoalu iešguđet gálduin dárkkistahtti vuogi mielde
smj: diehtet persåvnnåsuodjalime ja dahkkerievtesvuoda birra ja válljit ja adnet sisanov moattelágásj gáldojs dan láhkáj vaj le máhttelis dárkestit gáldojt maŋŋela

source: ságaškuššat eallinvugiid ja ovttastallanvugiid Stuorra-Británnias, USA:s, eará eaŋgalsgiel riikkain ja Norggas
smj: ságastallat viessomvuogij ja sæbrástallamvuogij birra Sorbritannian, USAan, ja ietjá ieŋŋilskgielak rijkajn ja Vuonan

source: selvehit Stuorra-Británnia ja USA ’ historjjáid ja geografiijaid váldoiešvuođaid
smj: tjielggit histåvrå ja geografija åsijt Storbritannian ja USAan

source: válddahit ja reflekteret álgoálbmogiid dili birra eaŋgalsgiel riikkain
smj: ságastallat duon dán ieŋŋilskgielak girjálasj tevstaj birra ieŋŋilskgielak rijkajs

source: hábmet, gaskkustit ja ságastallat iežas teavsttaid maidda inspirašuvdna lea vižžon eaŋgalsgiel girjjálašvuođas, filmmas ja kultuvrralaš ovdanbuktinvugiin
smj: dahkat, gaskostit ja ságastallat ietjas tevstaj birra ma li arvusmahtedum ieŋŋilskgielak girjálasjvuodas, filmajs ja kultuvralasj åvddånbuktemvuogijs

source: ságastallat iešguđet áigeguovdilis ja fágalaš fáttáid birra ja gaskkustit daid
smj: ságastallat ja gaskostit ájggeguovddelis ja fágalasj ássjij birra

source: Gelbbolašvuođamihttomearit Jo1:ža – studerenráhkkanahtti oahppoprográmmaid maŋŋil ja Jo2:ža – fidnofágalaš oahppoprográmmaid maŋŋil
smj: Máhtudakmihto Jo1 – oahppogárvedime åhpadusprográmma maŋŋel ja Jo2 – viddnofágalasj åhpadusprográmma maŋŋel

source: árvvoštallat ja geavahit iešguđet dilálašvuođaid, bargovugiid ja oahpahallanstrategiijaid ovdánahttit iežas eaŋgalsgielgálggaid
smj: árvustallat ja adnet duov dáv dilev, barggovuogev ja oahppamstrategijav gå le åvdedime ietjas tjehpudagáv ieŋŋilskgielan

source: árvvoštallat iežas ovdáneami eaŋgalsgieloahpahallamis
smj: árvustallat ietjas åvddånimev gå le ieŋŋilskgielav oahppamin

source: árvvoštallat iešguđet digitála resurssaid ja eará veahkkeneavvuid kritihkalaččat ja iešheanalaččat, ja geavahit daid iežas giellaoahpahallamis
smj: árvustallat duov dáv digitála ressursav ja ietjá viehkkenævojt lájttalisát ja iesjrádálattjat, ja adnet dajt gå iesj le gielav oahppamin

source: árvvoštallat ja geavahit heivvolaš guldalan- ja hállanstrategiijaid mat leat heivehuvvon ulbmiliidda ja dilálašvuhtii
smj: árvustallat ja adnet hiebalgis gulldalim- ja hållamstrategijajt hiebadum ulmmáj ja dilláj

source: áddet ja geavahit nana dábálaš sátneriggodaga ja fágalaš sátneriggodaga mii gullá iežas oahppoprográmmii
smj: dádjadit ja adnet vijdes dábálasj báhkoboanndudagáv ja fágalasj báhkoboanndudagáv mij le tjanádum ietjas åhpadusprográmmaj

source: áddet iešguđetlágan njálmmálaš teavsttaid váldosisdoalu ja detáljjaid dábálaš fáttáin ja fágalaš fáttáid birra mat gusket iežas oahppográmmii
smj: dádjadit oajvvesisanov ja detáljajt duot dát njálmálasj tevstas dábálasj ássjijn ja ássjijn ietjas åhpadusprográmmas

source: guldalit ja áddet eaŋgalsgiela sosiála ja geográfalaš variánttaid autenttalaš dilálašvuođain
smj: gulldalit ja dádjadit sosialalasj ja geografalasj variántajt autentalasj diles

source: álggahit, doalahit ja loahpahit ságastallamiid ja digaštallamiid dábálaš fáttáid ja fágalaš fáttáid birra mat gusket iežas oahppoprográmmii
smj: adnet gielav moatten dilen duolla ja avtatbirges, hiebadum ulmmáj ja dilláj álgadit, jådedit ja låhpadit ságastallamijt dábálasj ássjij ja fágalasj ássjij birra ietjas åhpadusprográmmas

source: geavahit jietnadeami, intonašuvnna, sátnesojaheami ja iešguđet cealkkatiippaid gulahallamis
smj: adnet gåvvusav jiednadime hárráj, intonasjåvnå, báhkosåjådime ja duon dán lágásj gárgadisáj hárráj gå le guládallamin

source: dulkot ja geavahit teknihkalaš ja matematihkalaš dieđuid gulahallamis
smj: dålkkut ja adnet teknihkalasj ja matematihkalasj diedojt guládallamijn

source: árvvoštallat ja geavahit heivvolaš lohkan- ja čállinstrategiijaid mat leat heivehuvvon ulbmilii ja teakstašládjii
smj: árvustallat duov dáv gáldov ja adnet gáldoj sisanov iesjrádálasj, lájttális ja guoradallam máhttelisvuogij milta

source: áddet váldosisdoalu ja detáljjaid iešguđet guhkkosaš teavsttain iešguđet fáttáid birra
smj: dádjadit oajvvesisanov ja detáljajt tevstajs vijdes sisanujn duot dát ássjes

source: lohkat háhkan dihtii fágamáhtu iežas oahppoprográmmas
smj: låhkåt ja åmastit fáhkamáhtov ietjas åhpadusprográmmas

source: geavahit iežas notáhtaid čállit teavsttaid mat gullet iežas oahppoprográmmii
smj: adnet ietjas notáhtajt gå le tevstaj tjállemin ma gulluji ietjas åhpadusprográmmaj

source: čállit iešguđetlágan teavsttaid struktuvrrain ja oktilisvuođain mii lea heivehuvvon ulbmilii ja dilálašvuhtii
smj: tjállet duov dáv avtarájak tevstav struktuvrajn, hiebadum ulmmaj ja dilláj

source: geavahit riektačállima, sátnesojaheami ja iešguđet cealkka- ja teakstahuksema minstariid teakstabuvttadeamis
smj: adnet guovdásj gåvvusav duollatjállema, báhkosåjådime ja duon dán lágásj gárgadisáj hárráj gå le tevstajt buvtadime

source: buvttadit iešguđetlágan teavsttaid mat leat heivehuvvon iešguđet digitála mediaid digitála hábmengáibádusaide
smj: buvtadit duov dáv tevstav hiebadum digitála hábmegájbbádussaj duon dán digitála midijájn

source: ságaškuššat moanaid eaŋgalsgiel riikkaid kultuvrra ja servodatdiliid
smj: ságastallat kultuvra ja sebrudakdilij birra moatten ieŋŋilskgielak rijkan

source: ovdanbuktit ja digaštallat eaŋgalsgiel gálduid áigeguovdilis ođđasiid
smj: åvddånbuktet ja sagástallat ájggeguovddelis ássjijt ieŋŋilskgielak gáldojs

source: ságaškuššat eaŋgalsgiela ovdáneami máilmmigiellan
smj: ságastallat ieŋŋilskgiela åvddånime birra væráltgiellan

source: ságaškuššat iešguđetlágan eaŋgalsgiel girjjálašvuođa teavsttaid iešguđet osiin máilmmis
smj: ságastallat duon dán ieŋŋilskgielak girjálasj tevstaj birra duot dát væráltguovlos

source: ságaškuššat eaŋgalsgiel filmmaid ja eará kulturovdanbuktimiid iešguđet mediain
smj: ságastallat ieŋŋilskgielak filmaj ja ietjá kultuvrraåvddånbuktemij birra duot dát medijás

source: ságaškuššat teavsttaid maid álgoálbmogat leat čállán, ja teavsttaid álgoálbmogiid birra eaŋgalsgiel riikkain
smj: ságastallat iemeálmmugij ja iemeálmmugij tevstaj birra ieŋŋilskgielak rijkajn

source: čiekŋudit fágalaš fáddái iežas oahppoprográmmas ja ovdanbuktit dán
smj: ietjas tjiegŋodit fágalasj ássjijn ietjas åhpadusprográmma milta ja åvddånbuktet dav ássjev

source: Árvvoštallan fágas
smj: Árvustallam fágan

source: Loahppaárvvoštallama mearrádusat:
smj: Loahppárvustallama mærrádusá:

source: Oppalašárvosáni árvvoštallan
smj: Åbbålasj árvustallam Jahkedásse

source: Ortnet
smj: Vuohke

source: 10. jahkeceahkki
smj: 10. jahkedásse

source: Oahppit galget oažžut ovtta čálalaš ja ovtta njálmmálaš oppalašárvosáni.
smj: Oahppe galggi oadtjot avtav tjálalasj ja avtav njálmálasj. Jo1 oahppogárvedime åhpadusprográmma

source: Jo2 fidnofágalaš oahppoprográmmat
smj: Jo2 viddnofágalasj åhpadusprográmma

source: Oahppit galget oažžut ovtta oppalašárvosáni.
smj: Oahppe galggi oadtjot avtav åbbålasj karakterav.

source: Eksámen ohppiide
smj: Eksámen - oahppe

source: Oahppit sáhttet vuorbáduvvot čálalaš eksámenii.
smj: Oahppe soajtti vuorbbáduvvat tjálalasj eksábmaj.

source: Čálalaš eksámen ráhkaduvvo ja sensurerejuvvo guovddáš ásahusain.
smj: Tjálalasj eksábma dagáduvvá ja árvustaláduvvá guovdálattjat.

source: Oahppit sáhttet maiddái vuorbáduvvot njálmmálaš eksámenii.
smj: Oahppe soajtti vuorbbáduvvat njálmálasj eksábmaj.

source: Njálmmálaš eksámen ráhkaduvvo ja sensurerejuvvo báikkálaččat.
smj: Njálmálasj eksábma bájkálattjat dagáduvvá ja sensureriduvvá.

source: Oahppit sáhttet maiddái vuordáduvvot njálmmálaš eksámenii.
smj: Oahppe soajtti aj vuorbbáduvvat njálmálasj eksábmaj.

source: Eksámen fátmmasta olles fága (140 tiimma).
smj: Eksábmaj gullu ålles fáhka (140 timer).

source: Eksámen privatisttaide
smj: Eksámen - privatista

source: Geahča rávisolbmuid vuođđoskuvlaoahpahusa gustovaš ortnega.
smj: Gehtja doajmme årnigav ållessjattugij vuodoskåvllååhpadusán.

source: Privatisttat galget váldit čálalaš ja njálmmálaš eksámena.
smj: Privatista galggi tjadádit tjálalasj ja njálmálasj eksámav.
